#1. Составить программу нахождения наибольшего общего делителя (НОД)
#и наименьшего общего кратного (НОК) двух натуральных чисел НОК(А, В) =
#(A*B)/НОД(A,B). Использовать подпрограмму алгоритма Евклида для
#определения НОД.
def find_nod(a, b):
    while b != 0:
        a, b = b, a % b
    return a

a = int(input("Введите первое натуральное число (A): "))
b = int(input("Введите второе натуральное число (B): "))

nod = find_nod(a, b)
nok = (a * b) // nod

print(f"НОД({a}, {b}) = {nod}")
print(f"НОК({a}, {b}) = {nok}")


#2. Написать рекурсивную функцию вычисления степени nвещественного
#числа a(n–натуральное число)
def power(a, n):
    if n == 1:
        return a
    else:
        return a * power(a, n - 1)

a = float(input("Введите вещественное число a: "))
n = int(input("Введите натуральное число n: "))

result = power(a, n)
print(f"{a}^{n} = {result}")