#1. Найти сумму квадратов всех целых чисел от a до 50 (значение a вводится
#с клавиатуры; 0 ≤a≤50). Решить задачу используя циклическую конструкцию
#for.
#2. Дано целое число N (> 1). Найти наименьшее целое число K, при
#котором выполняется неравенство 5^K > N.
#Решить задачу используя циклическую конструкцию while

a = int(input("Введите значение a (от 0 до 50): "))

sum_squares = 0
for i in range(a, 51):
    sum_squares += i ** 2

print(f"Сумма квадратов от {a} до 50 равна {sum_squares}")



N = int(input("Введите целое число N (N > 1): "))

K = 0
while 5 ** K <= N:
    K += 1
print(f"Наименьшее целое K, при котором 5^{K} > {N}, равно {K}")